In [3]:
import pandas as pd   #تتعامل مع الداتا ك object + و تتعامل مع الداتا ف شكل صفوف و اعمده

The pandas series object

Series 

california  33345
florida     170312
illinois    149999
new york    123456
texas       145920

DaTaframe

            area   population
california  33345   123456
florida     170312  464321
illinois    149999  355940
new york    123456  134093
texas       145920  223048   col in dataframeالفرق بينهم هما الاتنين ان ف اسماء لل

In [4]:
#created series from list
data=pd.Series([1,2,3,4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
#convert it to numpy array
print(data.values)
print(type(data.values))

[1 2 3 4]
<class 'numpy.ndarray'>

In [6]:
data[3]

4

In [7]:
#custom indexing عايز انت تحدد اسماء الindex in series 
بدل ما هى  0 1 2 #3
data=pd.Series([1,2,3,4],index=['first','second','third','fourth'])
data

SyntaxError: invalid syntax (Temp/ipykernel_20608/3660515194.py, line 2)

In [ ]:
data['third']

A series from a python dictionary

In [ ]:
data={'california': 33345
,'florida': 170312
,'illinois':149999
,'new york':123456
,'texas':145920    
}
data

In [ ]:
data=pd.Series(data)
data

In [ ]:
data['california']

In [ ]:
data['california':'new york']

In [ ]:
data[0:3]

# DataFrame

In [10]:
#creating dataframe from series
dict={'california': 33345
,'florida': 170312
,'illinois':149999
,'new york':123456
,'texas':145920
     }
population=pd.Series(dict)
population

california     33345
florida       170312
illinois      149999
new york      123456
texas         145920
dtype: int64

In [11]:
dict2={'california': 333
,'florida': 170
,'illinois':149
,'new york':123
,'texas':145}
area=pd.Series(dict2)
area

california    333
florida       170
illinois      149
new york      123
texas         145
dtype: int64

In [12]:

pd.DataFrame({'population':population,'area':area})

            population  area
california       33345   333
florida         170312   170
illinois        149999   149
new york        123456   123
texas           145920   145

In [18]:
#creating dataframe from py dictionaries
data=pd.DataFrame({'population':[33345,170312,149999,123456,145920],'area':[333,170,149,123,145]},index= ['california','florida','illinois','new york','texas'])
data

            population  area
california       33345   333
florida         170312   170
illinois        149999   149
new york        123456   123
texas           145920   145

to get the name of rows

In [19]:
data.index

Index(['california', 'florida', 'illinois', 'new york', 'texas'], dtype='object')

to get the name of rows

In [21]:
data.columns

Index(['population', 'area'], dtype='object')

In [22]:
data['area']

california    333
florida       170
illinois      149
new york      123
texas         145
Name: area, dtype: int64

In [23]:
type(data['area'] )

pandas.core.series.Series

In [24]:
data['area']['california']

333

In [26]:
#creating dataframe from a single series object
pd.DataFrame({'area':area})

            area
california   333
florida      170
illinois     149
new york     123
texas        145

In [28]:
#creating dataframe from a list of dictionary
data=[{'a':1,'b':2},
     {'c':3,'d':4}
      ]
pd.DataFrame(data)

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

In [32]:
#creating dataframe from 2d numpy array
import numpy as np
arr=np.random.randint(1,20,30).reshape(10,3)
arr

array([[ 8,  3,  1],
       [10, 11, 14],
       [ 9, 17, 16],
       [10, 17,  5],
       [12,  6,  5],
       [ 4,  8, 18],
       [17,  7, 19],
       [14, 15,  3],
       [17,  5, 16],
       [11, 10, 14]])

In [35]:
pd.DataFrame(arr,columns=['age','len','width'],index=[i*2 for i in range(10)])

    age  len  width
0     8    3      1
2    10   11     14
4     9   17     16
6    10   17      5
8    12    6      5
10    4    8     18
12   17    7     19
14   14   15      3
16   17    5     16
18   11   10     14